# running in verify_comparator_coverage/src/
read -formal pwm_comparator.v
prep -top pwm_comparator

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
